tutorials/multiRegion/CHT/hotWire/system/createNonConformalCouplesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createNonConformalCouplesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fields          no;

nonConformalCouples
{
    electrode
    {
        regions         (solid fluid);
        patches         (nonCoupleElectrode nonCoupleElectrode);
    }

    wire
    {
        regions         (solid fluid);
        patches         (nonCoupleWire nonCoupleWire);
    }
}

// ************************************************************************* //
